Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
fks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            sudo apt-get update
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = puppet
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
            echo "35.233.219.1 puppet" >> /etc/hosts
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "cassandra-amer-0"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = "us-east1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.cassandra[1] will be created
+ resource "google_compute_instance" "cassandra" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "f1-micro"
      + metadata                = {
          + "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            sudo apt-get update
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = puppet
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
            echo "35.233.219.1 puppet" >> /etc/hosts
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "cassandra-amer-1"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = "us-central-1c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.cassandra[2] will be created
+ resource "google_compute_instance" "cassandra" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "f1-micro"
      + metadata                = {
          + "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            sudo apt-get update
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = puppet
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
            echo "35.233.219.1 puppet" >> /etc/hosts
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "cassandra-amer-2"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = "us-east1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_dns_record_set.cassandra[0] will be created
+ resource "google_dns_record_set" "cassandra" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "cassandraus-east10.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.cassandra[1] will be created
+ resource "google_dns_record_set" "cassandra" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "cassandraus-central11.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.cassandra[2] will be created
+ resource "google_dns_record_set" "cassandra" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "cassandraus-east12.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p cassandra_amer_nodes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Fcassandra%252Fgcp_nodes%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p cassandra_amer_nodes`
</details>

---
### 10. project: `cassandra_euro_nodes` dir: `cassandra/gcp_nodes` workspace: `euro`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_address.static[0] will be created
+ resource "google_compute_address" "static" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cassandra-0e01d6bc3de72d829"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "europe-west4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_address.static[1] will be created
+ resource "google_compute_address" "static" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cassandra-1e01d6bc3de72d829"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "europe-north1-a"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_address.static[2] will be created
+ resource "google_compute_address" "static" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cassandra-2e01d6bc3de72d829"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "europe-west4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_instance.cassandra[0] will be created
+ resource "google_compute_instance" "cassandra" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "f1-micro"
      + metadata                = {
          + "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            sudo apt-get update
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = puppet
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
            echo "35.233.219.1 puppet" >> /etc/hosts
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "cassandra-euro-0"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = "europe-west4-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.cassandra[1] will be created
+ resource "google_compute_instance" "cassandra" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "f1-micro"
      + metadata                = {
          + "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            sudo apt-get update
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = puppet
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
            echo "35.233.219.1 puppet" >> /etc/hosts
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "cassandra-euro-1"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = "europe-north1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.cassandra[2] will be created
+ resource "google_compute_instance" "cassandra" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "f1-micro"
      + metadata                = {
          + "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            sudo apt-get update
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = puppet
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
            echo "35.233.219.1 puppet" >> /etc/hosts
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "cassandra-euro-2"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = "europe-west4-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_dns_record_set.cassandra[0] will be created
+ resource "google_dns_record_set" "cassandra" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "cassandraeurope-west40.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.cassandra[1] will be created
+ resource "google_dns_record_set" "cassandra" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "cassandraeurope-north1-a1.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.cassandra[2] will be created
+ resource "google_dns_record_set" "cassandra" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "cassandraeurope-west42.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p cassandra_euro_nodes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Fcassandra%252Fgcp_nodes%252Feuro)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p cassandra_euro_nodes`
</details>

---
### 11. project: `cassandra_asia_nodes` dir: `cassandra/gcp_nodes` workspace: `asia`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p cassandra_asia_nodes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Fcassandra%252Fgcp_nodes%252Fasia)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p cassandra_asia_nodes`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
